# running in gcd_part5_cover/src/
read -formal gcd.sv
read -formal gcd_ctrl.sv
prep -top gcd

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
